Revit 2027 API
Level Methods
The Level type exposes the following members.
Methods
Name | Description
AddLeader |  Adds a default Leader for the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanBeVisibleInView |  Checks if the datum plane can be visible in the view.
(Inherited from DatumPlane)
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
Create |  Creates a new instance of level based on an input elevation.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
FindAssociatedPlanViewId |  Finds the id of the first available associated floor or structural plan view associated with this level.
GetCurvesInView |  Gets a collection of curves representing the DatumPlane element in the given view.
(Inherited from DatumPlane)
GetDatumExtentTypeInView |  Identifies whether the curve representing the datum plane is displayed according to its actual 3d extents, or else according to a view specific setting.
(Inherited from DatumPlane)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLeader |  Gets a copy of the leader applied to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetNearestLevelId(Document, Double) |  Returns id of the Level which is closest to the specified elevation.
GetNearestLevelId(Document, Double, Double) |  Returns id of the Level which is closest to the specified elevation.
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetPlaneReference |  Returns a reference to this element as a plane.
GetPropagationViews |  Gets a list of candidate views which are parallel to the current view and to which the extents of the datum may be propagated.
(Inherited from DatumPlane)
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasBubbleInView |  Identifies if the DatumPlane has bubble or not.
(Inherited from DatumPlane)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
HideBubbleInView |  Hides the bubble in a view. This method does not apply to Reference planes.
(Inherited from DatumPlane)
IsBubbleVisibleInView |  Identifies if the bubble is visible or not in a view.
(Inherited from DatumPlane)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsCurveValidInView |  Checks if the curve is valid to be as the extents for the datum plane in a view. The curve must be bound and coincident with the original one of the datum plane.
(Inherited from DatumPlane)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsLeaderValid |  Identifies if the leader valid or not for this DatumPlane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
Maximize3DExtents |  Computes the 3d extents of all model geometry and levels, and extends the 3d extents of this datum surface to include the model extents.
(Inherited from DatumPlane)
PropagateToViews |  Propagates the extents applied to this datum in the view to the specified parallel views.
(Inherited from DatumPlane)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
SetCurveInView |  Sets the extents to match the curve.
(Inherited from DatumPlane)
SetDatumExtentType |  Sets whether the curve representing the datum plane is displayed according to its 3d extents, or else according to a view specific setting.
(Inherited from DatumPlane)
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetLeader |  Sets the leader to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
(Inherited from DatumPlane)
ShowBubbleInView |  Shows the bubble in a view. This method does not apply to Reference planes.
(Inherited from DatumPlane)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Level Class
Autodesk.Revit.DB Namespace